7zip
btop
caligula
eza
fastfetch
fd-find
ffmpeg
git
imagemagick
jq
micro
poppler-utils
resvg
ripgrep
rsync
samba
speedtest-cli
starship
tldr
tree
zoxide
zsh
