7zip
alacritty
bat
bat-extras
btop
caligula
docker
docker-buildx
docker-compose
eza
fastfetch
fd
ffmpeg
fzf
git
github-cli
imagemagick
jq
lazydocker
lazygit
localsend
micro
openssh
poppler
resvg
ripgrep
rsync
ruff
speedtest-cli
starship
tailscale
tldr
tree
ttf-jetbrains-mono-nerd
uv
visual-studio-code-bin
vulkan-intel
yay
yazi
zed
zoxide
zsh
